# IsValidImageSymbolId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..IsValidImageSymbolId Method
TableSectionData Class See Also
---
Identifies if the element id represents a valid ImageSymbol element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsValidImageSymbolId(
	ElementId imageSymbolId
)
```

Visual Basic
---
```text
Public Function IsValidImageSymbolId ( _
	imageSymbolId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidImageSymbolId(
	ElementId^ imageSymbolId
)
```

# ### Parameters
imageSymbolId
    Type: Autodesk.Revit.DB..::..ElementId The element id of the image symbol.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace